# StairstypeCalculationRules Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeCalculationRules Property
ParameterTypeId Class See Also
---
"Calculation Rules": Calculation Rules
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeCalculationRules { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeCalculationRules As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeCalculationRules {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace